-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-07-30 03:36:01
-- 伺服器版本： 8.0.36
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mudanlow`
--

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `id` int NOT NULL,
  `sn` varchar(255) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `brand_id` int NOT NULL,
  `cat_id` int NOT NULL,
  `photos` text,
  `stock` varchar(255) DEFAULT NULL,
  `price` int DEFAULT NULL,
  `info` text,
  `color` varchar(255) DEFAULT NULL,
  `size` varchar(255) DEFAULT NULL,
  `tag` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`id`, `sn`, `name`, `brand_id`, `cat_id`, `photos`, `stock`, `price`, `info`, `color`, `size`, `tag`, `created_at`, `updated_at`) VALUES
(1, '09fdab8a-6185-4484-8bea-c47d85647d8b', '蝦菇奶油醬', 4, 1, '菜01.jpg, 菜1.jpg, 菜001.jpg', '90', 350, '蝦菇奶油醬是一款美味且豐富的醬料，專為喜愛海鮮和奶油風味的人士打造。這款醬料結合了鮮蝦、香菇和奶油的美妙味道，是烹飪多種菜餚的完美選擇。', '蝦、蘑菇、黃油、蒜末、麵粉、牛奶、淡奶油、鹽、黑胡椒、芝士', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(2, '09fdab8a-6185-4484-8bea-c47d85647d8b', '波士頓龍蝦', 4, 1, '菜2.jpg, 菜02.jpg, 菜002.jpg', '90', 680, '是來自北大西洋的一種龍蝦品種。它以其豐富的肉質、甜美的味道和獨特的口感而著稱。', '波士頓龍蝦、大蒜、黃油、檸檬、香草、鹽、黑胡椒', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(3, '09fdab8a-6185-4484-8bea-c47d85647d8b', '蛤蜊燉湯', 4, 1, '菜3.jpg, 菜03.jpg, 菜003.jpg', '90', 250, '以新鮮的蛤蜊為主要材料，搭配清淡的湯底和香料，是一道口感鮮美、營養豐富的湯品。。', '新鮮蛤蜊、薑片、大蒜、蔥、白酒（或米酒）、水、鹽、白胡椒粉。', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(4, '09fdab8a-6185-4484-8bea-c47d85647d8b', '熱豆花', 3, 1, '菜4.jpg, 菜04.jpg, 菜004.jpg', '90', 90, '熱豆花是一道以嫩豆腐為主要原料製作的甜品，通常配以甜糖水或糖漿，口感滑嫩，是夏日消暑的經典選擇。', '黃豆、內酯、水、紅糖、姜', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(5, '09fdab8a-6185-4484-8bea-c47d85647d8b', '中式川味麻辣魚', 4, 1, '菜5.jpg, 菜05.jpg, 菜005.jpg', '90', 350, '中式川味麻辣魚是一道具有濃郁川菜風味的魚類料理。其特色在於以麻辣調味為主，口感辣而麻，具有濃郁的香料風味和豐富的醬汁。', '魚片、乾辣椒、花椒、生薑、大蒜、蔥、豆瓣醬、醬油、料酒、鹽、糖、花生油、辣椒油、雞精', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(6, '09fdab8a-6185-4484-8bea-c47d85647d8b', '古早味控肉', 1, 1, '菜6.jpg, 菜06.jpg, 菜006.jpg', '90', 180, '以豬腩肉為主料，經過長時間的燉煮，肉質軟嫩，入口即化。它的特色在於醬汁濃郁、味道豐富，是一道家常菜中的經典之作。', '豬肉、鹽、糖、香料（如五香粉）、醬油', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(7, '09fdab8a-6185-4484-8bea-c47d85647d8b', '藥膳香腸', 1, 1, '菜7.jpg, 菜07.jpg, 菜007.jpg', '90', 150, '添加了多種中藥材和調味料製成的腸製品。它不僅具有傳統香腸的口感，還有中藥材的滋補效果，是一種兼具美食與養生功效的特色食品。', '豬肉、香料（如五香粉、八角）、草藥（如陳皮、當歸、枸杞等）、鹽、糖、米酒', '3,4,1,2', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(8, '', '北平烤鴨', 1, 1, '菜8.jpg, 菜08.jpg, 菜008.jpg', '0', 250, '外皮酥脆，肉質鮮嫩多汁，搭配薄餅、甜麵醬和大蔥，口感豐富。', '鴨子、鹽、醬油、糖、香料（如蔥、薑、大料等）', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(9, '', '鮮味肉包', 1, 1, '菜9.jpg, 菜09.jpg, 菜009.jpg', '0', 120, '鮮味肉包皮薄餡多，內餡鮮嫩多汁，外皮軟糯可口，蒸製後香氣四溢', '豬肉、鹽、糖、蔥、薑、香料（如五香粉）、醬油、麵粉', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(10, '', '爆炒青菜', 2, 1, '菜10.jpg, 菜010.jpg, 菜0010.jpg', '0', 110, '鮮嫩的青菜在大火快炒後，保持脆嫩口感，並且保留了青菜的鮮美滋味，簡單調味，突出原汁原味', '菠菜、蒜、鹽、醬油、食用油', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(11, '', '皮蛋炒苦瓜', 2, 1, '菜11.jpg, 菜011.jpg, 菜0011.jpg', '0', 130, '皮蛋的滑嫩口感與苦瓜的微苦清爽相互融合，味道獨特，營養豐富。', '苦瓜、皮蛋、蒜、鹽、醬油、食用油', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(12, '', '蒜香水炒五色時蔬', 2, 1, '菜12.jpg, 菜012.jpg, 菜0012.jpg', '0', 130, '多種顏色的蔬菜組合在一起，既美觀又營養豐富，蒜香味十足，清爽可口。', '蒜、紅蘿蔔、青椒、黃椒、蘑菇、花椰菜', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(13, '', '蒜炒高麗菜', 2, 1, '菜13.jpg, 菜013.jpg, 菜0013.jpg', '0', 150, '高麗菜口感脆嫩，蒜香味濃郁，簡單調味，突顯食材的原味，爽口美味。', '高麗菜、蒜、鹽、食用油  ', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(14, '', '清炒鮮香菇', 2, 1, '菜14.jpg, 菜014.jpg, 菜0014.jpg', '0', 150, '鮮香菇保留了其天然的鮮美滋味，口感嫩滑，清炒方式讓香菇的香氣更加突出，簡單的調味突顯食材的原味。', '鮮香菇、蒜、鹽、食用油', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(15, '', '木耳洋蔥菇', 2, 1, '菜15.jpg, 菜015.jpg, 菜0015.jpg', '0', 150, '木耳脆爽，洋蔥甜美，蘑菇鮮嫩，三者結合口感豐富，營養均衡，簡單調味突顯食材本身的美味。', '木耳、洋蔥、香菇，以及蒜、鹽、食用油', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(16, '', '奶焗蝦', 4, 1, '菜16.jpg, 菜016.jpg, 菜0016.jpg', '0', 430, '鮮嫩的蝦肉搭配濃郁的奶香，焗烤後外表金黃，內裡鮮嫩多汁，口感豐富，味道鮮美。', '蝦子、牛奶、鹽、胡椒粉、奶酪', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(17, '', '炸湯圓', 3, 1, '菜17.jpg, 菜017.jpg, 菜0017.jpg', '0', 140, '外皮酥脆，內餡香甜軟糯，口感層次豐富，吃起來香脆可口。', '湯圓、食用油和糖粉', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07'),
(18, '', '杞子桂花糕', 3, 1, '菜18.jpg, 菜018.jpg, 菜0018.jpg', '0', 170, '杞子（枸杞）富含營養，桂花香氣怡人，與清甜的糕體相結合，口感細膩，風味獨特，甜而不膩。', '糯米粉、水、桂花、杞子、糖', '', '所有產品享受免費寄送和退換貨服務。請在收到商品後7天內申請退換貨，商品需保持全新狀態並附上發票。', '2024-07-23 11:25:07', '2024-07-23 11:25:07');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
